#include"MyHeader.h"

Typeing::Typeing()
{
	string moji_J[160] =
	{
		"Ç†",   "Ç¢",    "Ç§",    "Ç¶",    "Ç®",
		"Ç©",   "Ç´",    "Ç≠",	  "ÇØ",    "Ç±",
		"Ç≥",   "Çµ",    "Ç∑",	  "Çπ",    "Çª",
		"ÇΩ",   "Çø",    "Ç¬",	  "Çƒ",	   "Ç∆",
		"Ç»",   "Ç…",    "Ç ",	  "ÇÀ",	   "ÇÃ",
		"ÇÕ",   "Ç–",	 "Ç”",	  "Ç÷",	   "ÇŸ",
		"Ç‹",   "Ç›",	 "Çﬁ",	  "Çﬂ",	   "Ç‡",
		//45


		"Ç‚",   "Ç‰",	 "ÇÊ",			  
		"ÇÁ",   "ÇË",	 "ÇÈ",	  "ÇÍ",	   "ÇÎ",
		"ÇÌ",   "Ç",	 "ÇÒ",			  
		//11

		"Ç™",   "Ç¨",	 "ÇÆ",	  "Ç∞",	   "Ç≤",
		"Ç¥",   "Ç∂",	 "Ç∏",	  "Ç∫",	   "Çº",
		"Çæ",   "Ç¿",	 "Ç√",	  "Ç≈",	   "Ç«",
		"ÇŒ",   "Ç—",	 "Ç‘",	  "Ç◊",	   "Ç⁄",
		"Çœ",   "Ç“",	 "Ç’",	  "Çÿ",	   "Ç€",
		//25

		"Ç´Ç·",   "Ç´Ç„",	 "Ç´ÇÂ",
		"Ç¨Ç·",   "Ç¨Ç„",	 "Ç¨ÇÂ",
		"ÇµÇ·",   "ÇµÇ„",	 "ÇµÇÂ",	 "ÇµÇ•",
		"Ç∂Ç·",   "Ç∂Ç„",	 "Ç∂ÇÂ",	 "Ç∂Ç•",
		"ÇøÇ·",   "ÇøÇ„",	 "ÇøÇÂ",	 "ÇøÇ•",
		//18

		"Ç¿Ç·",   "Ç¿Ç„",	 "Ç¿ÇÂ",
		"Ç…Ç·",   "Ç…Ç„",	 "Ç…ÇÂ",
		"Ç–Ç·",   "Ç–Ç„",	 "Ç–ÇÂ",
		"Ç—Ç·",   "Ç—Ç„",	 "Ç—ÇÂ",
		"Ç“Ç·",   "Ç“Ç„",	 "Ç“ÇÂ",
		"Ç”Çü",   "Ç”Ç°",	 "Ç”Ç•",	"Ç”Çß",
		"Ç”Ç·",   "Ç”Ç„",	 "Ç”ÇÂ",
		"Ç›Ç·",   "Ç›Ç„",	 "Ç›ÇÂ",
		"ÇËÇ·",   "ÇËÇ„",	 "ÇËÇÂ",

		"Ç¡"
		//29

		"Çü",   "Ç°",	 "Ç£",	  "Ç•",	   "Çß",
		"Ç·",   "Ç„",	 "ÇÂ",
		"ÇÏ",
		"Ç§Çü",   "Ç§Ç°",	 "Ç§Ç•",	 "Ç§Çß",
		"ÉîÇü",   "ÉîÇ°",	 "Éî",	  "ÉîÇ•",	   "ÉîÇß",
		"ÇƒÇ°",   "Ç≈Ç°",	 "Ç≈Ç„",
		"Å[",
		//32
	};
	for (int i = 0; i < 160; i++)
	{
		StringConvTable[i].BaseString = moji_J[i];
	}
	

	/*{  
		{  Ç†",           { "a"   } },        {"Ç¢",  {"i"       }},       {"Ç§",  {"u"      }},       {"Ç¶",   {"e"  }},   {"Ç®",   {"o"  } },
		{ "Ç©",           { "ka"  } },        {"Ç´",  {"ki"      }},       {"Ç≠",  {"ku"     }},       {"ÇØ",   {"ke" }},   {"Ç±",   {"ko" }},
		{ "Ç≥",           { "sa"  } },        {"Çµ",  {"si","shi"}},       {"Ç∑",  {"su"     }},       {"Çπ",   {"se" }},   {"Çª",   {"so" }},
		{ "ÇΩ",           { "ta"  } },        {"Çø",  {"ti","chi"}},       {"Ç¬",  {"tu"     }},       {"Çƒ",   {"te" }},   {"Ç∆",   {"to" }},
		{ "Ç»",           { "na"  } },        {"Ç…",  {"ni"      }},       {"Ç ",  {"nu"     }},       {"ÇÀ",   {"ne" }},   {"ÇÃ",   {"no" }},
		{ "ÇÕ",           { "ha"  } },        {"Ç–",  {"hi"      }},       {"Ç”",  {"hu","fu"}},       {"Ç÷",   {"he" }},   {"ÇŸ",   {"ho" }},
		{ "Ç‹",           { "ma"  } },        {"Ç›",  {"mi"      }},       {"Çﬁ",  {"mu"     }},       {"Çﬂ",   {"me" }},   {"Ç‡",   {"mo" }},
		{ "Ç‚",           { "ya"  } },        {"Ç‰",  {"yu"      }},       {"ÇÊ",  {"yo"     }},	     		   	    	     		   
		{ "ÇÁ",           { "ra"  } },        {"ÇË",  {"ri"      }},       {"ÇÈ",  {"ru"     }},       {"ÇÍ",   {"re" }},   {"ÇÎ",   {"ro" }},
		{ "ÇÌ",           { "wa"  } },        {"Ç",  {"wo"      }},       {"ÇÒ",  {"nn"     }},	     		   	   		     		   
		{ "Çü",           { "la"  } },        {"Ç°",  {"li"      }},       {"Ç£",  {"lu"     }},       {"Ç•",   {"le" }},   {"Çß",   {"lo" }},
		{ "Ç·",           { "lya" } },        {"Ç„",  {"lyu"     }},       {"ÇÂ",  {"lyo"    }},	   
		{ "Ç¡",           { "ltu" } },        {"ÇÏ",  {"lwa"     }},     							    
		{ "Ç≠Ç£",         { "Qa"  } },        {"Ç≠Ç°",{"qi"      }},       {"Ç≠Ç•",{"qe"     }},       {"Ç≠Çß", {"qo" }},
		{ "Ç§Çü",         { "wha" } },        {"Ç§Ç°",{"wi"      }},       {"Ç§Ç•",{"we"     }},	    
		{ "Ç≈Ç·",         { "dha" } },        {"Ç≈Ç°",{"dhi"     }},       {"Ç≈Ç„",{"dhu"    }},       {"Ç≈Ç•" ,{"dhe"}},   {"Ç≈ÇÂ", {"dho"}},
		{ "Ç™",           { "dha" } },        {"Ç¨",  {"dhi"     }},       {"ÇÆ",  {"dhu"    }},       {"Ç∞",   {"dhe"}},   {"Ç≤",   {"dho"}},

		
		{NULL,{NULL}},
	};*/
}

Typeing::~Typeing()
{
}
