#pragma once
#include"MyHeader.h"
class Typeing
{
public:
	Typeing();
	~Typeing();
	void Update();
	void Draw();
	string CreateRomaJI(const string& num);
private:
	struct CONVDATA
	{
		// ローマ仮名に変換する前の文字列
		const char* BaseString;

		// 入力するアルファベットの文字列
		const char* InputChars[10];
	};
	
	CONVDATA StringConvTable[200]=
	{
		{  "あ",           { "a"   } },        {"い",  {"i"       }},       {"う",  {"u"      }},       {"え",   {"e"  }},   {"お",   {"o"  } },
		{ "か",           { "ka","ca"  } },        {"き",  {"ki"      }},       {"く",  {"ku" ,"cu"    }},       {"け",   {"ke" }},   {"こ",   {"ko","co" }},
		{ "さ",           { "sa"  } },        {"し",  {"si","shi","ci"}},       {"す",  {"su"     }},       {"せ",   {"se","ce" }},   {"そ",   {"so" }},
		{ "た",           { "ta"  } },        {"ち",  {"ti","chi"}},       {"つ",  {"tu", "tsu"    }},       {"て",   {"te" }},   {"と",   {"to" }},
		{ "な",           { "na"  } },        {"に",  {"ni"      }},       {"ぬ",  {"nu"     }},       {"ね",   {"ne" }},   {"の",   {"no" }},
		{ "は",           { "ha"  } },        {"ひ",  {"hi"      }},       {"ふ",  {"hu","fu"}},       {"へ",   {"he" }},   {"ほ",   {"ho" }},
		{ "ま",           { "ma"  } },        {"み",  {"mi"      }},       {"む",  {"mu"     }},       {"め",   {"me" }},   {"も",   {"mo" }},
		{ "や",           { "ya"  } },        {"ゆ",  {"yu"      }},       {"よ",  {"yo"     }},
		{ "ら",           { "ra"  } },        {"り",  {"ri"      }},       {"る",  {"ru"     }},       {"れ",   {"re" }},   {"ろ",   {"ro" }},
		{ "わ",           { "wa"  } },        {"を",  {"wo"      }},       {"ん",  {"nn","xn"     }},

		{ "が",           { "ga"  } },        {"ぎ",  {"gi"      }},       {"ぐ",  {"gu"     }},       {"げ",   {"ge" }},   {"ご",   {"go" }},
		{ "ざ",           { "za"  } },        {"じ",  {"zi","ji" }},       {"ず",  {"zu"     }},       {"ぜ",   {"ze" }},   {"ぞ",   {"zo" }},
		{ "だ",           { "da"  } },        {"ぢ",  {"di"      }},       {"づ",  {"du"     }},       {"で",   {"de" }},   {"ど",   {"do" }},
		{ "ば",           { "ba"  } },        {"び",  {"bi"      }},       {"ぶ",  {"bu"     }},       {"べ",   {"be" }},   {"ぼ",   {"bo" }},
		{ "ぱ",           { "pa"  } },        {"ぴ",  {"pi"      }},       {"ぷ",  {"pu"     }},       {"ぺ",   {"pe" }},   {"ぽ",   {"po" }},

		{"きゃ",{"kya"}},{"きゅ",{"kyu"}},{"きょ",{"kyo"}},
		{"ぎゃ",{"gya"}},{"ぎゅ",{"gyu"}},{"ぎょ",{"gyo"}},
		{"しゃ",{"sya","sha"}},{"しゅ",{"syu","shu"}},{"しょ",{"syo","sho"}},{"しぇ",{"sye","she"}},
		{"じゃ",{"jya"}},{"じゅ",{"jyu"}},{"じょ",{"jyo"}},{"じぇ",{"jye"}},
		{"ちゃ",{"tya","cha"}},{"ちゅ",{"tyu","chu"}},{"ちょ",{"tyo","cho"}},{"ちぇ",{"tye","che"}},
		{"ぢゃ",{"dya"}},{"ぢゅ",{"dyu"}},{"ぢょ",{"dyo"}},
		{"にゃ",{"nya"}},{"にゅ",{"nyu"}},{"にょ",{"nyo"}},
		{"ひゃ",{"hya"}},{"ひゅ",{"hyu"}},{"ひょ",{"hyo"}},
		{"びゃ",{"bya"}},{"びゅ",{"byu"}},{"びょ",{"byo"}},
		{"ぴゃ",{"pya"}},{"ぴゅ",{"pyu"}},{"ぴょ",{"pyo"}},
		{"ふぁ",{"fa"}},{"ふぃ",{"fi"}},{"ふぇ",{"fu"}},{"ふぉ",{"fo"}},
		{"みゃ",{"mya"}},{"みゅ",{"myu"}},{"みょ",{"myo"}},
		{"りゃ",{"rya"}},{"りゅ",{"ryu"}},{"りょ",{"ryo"}},

		{"ぁ",{"la","xa"}},{"ぃ",{"li","xi"}},{"ぅ",{"lu","xu"}},{"ぇ",{"le","xe"}},{"ぉ",{"lo","xo"}},
		{"ゃ",{"lya","xya"}},{"ゅ",{"lyu","xyu"}},{"ょ",{"lyo","xyo"}},
		{"ゎ",{"lwa","xwa"}},
		{"うぁ",{"wha"}},{"うぃ",{"wi"}},{"うぇ",{"we"}},{"うぉ",{"who"}},
		{"ヴぁ",{"va"}},{"ヴぃ",{"vi"}},{"ヴ",{"vu"}},{"ヴぇ",{"ve"}},{"ヴぉ",{"vo"}},
		{"てぃ",{"thi"}},{"でぃ",{"dhi"}},{"でゅ",{"dhu"}},{"ー",{"-"}},

		{NULL,{NULL}},
	};
};
