#include"MyHeader.h"

Typeing::Typeing()
{

	

	
}

Typeing::~Typeing()
{
}

string Typeing::CreateCharROMA(string japaneseHIRAGANA)
{
	int i,j;

	return japaneseHIRAGANA;
}

void Typeing::Update()
{
	printfDx(CreateCharROMA("Ç±ÇÒÇ…ÇøÇÌ").c_str());
}





/*StringConvTable;*/
	//string moji_J[160] =
	//{
	//	"Ç†",   "Ç¢",    "Ç§",    "Ç¶",    "Ç®",
	//	"Ç©",   "Ç´",    "Ç≠",	  "ÇØ",    "Ç±",
	//	"Ç≥",   "Çµ",    "Ç∑",	  "Çπ",    "Çª",
	//	"ÇΩ",   "Çø",    "Ç¬",	  "Çƒ",	   "Ç∆",
	//	"Ç»",   "Ç…",    "Ç ",	  "ÇÀ",	   "ÇÃ",
	//	"ÇÕ",   "Ç–",	 "Ç”",	  "Ç÷",	   "ÇŸ",
	//	"Ç‹",   "Ç›",	 "Çﬁ",	  "Çﬂ",	   "Ç‡",
	//	//45


	//	"Ç‚",   "Ç‰",	 "ÇÊ",			  
	//	"ÇÁ",   "ÇË",	 "ÇÈ",	  "ÇÍ",	   "ÇÎ",
	//	"ÇÌ",   "Ç",	 "ÇÒ",			  
	//	//11

	//	"Ç™",   "Ç¨",	 "ÇÆ",	  "Ç∞",	   "Ç≤",
	//	"Ç¥",   "Ç∂",	 "Ç∏",	  "Ç∫",	   "Çº",
	//	"Çæ",   "Ç¿",	 "Ç√",	  "Ç≈",	   "Ç«",
	//	"ÇŒ",   "Ç—",	 "Ç‘",	  "Ç◊",	   "Ç⁄",
	//	"Çœ",   "Ç“",	 "Ç’",	  "Çÿ",	   "Ç€",
	//	//25

	//	"Ç´Ç·",   "Ç´Ç„",	 "Ç´ÇÂ",
	//	"Ç¨Ç·",   "Ç¨Ç„",	 "Ç¨ÇÂ",
	//	"ÇµÇ·",   "ÇµÇ„",	 "ÇµÇÂ",	 "ÇµÇ•",
	//	"Ç∂Ç·",   "Ç∂Ç„",	 "Ç∂ÇÂ",	 "Ç∂Ç•",
	//	"ÇøÇ·",   "ÇøÇ„",	 "ÇøÇÂ",	 "ÇøÇ•",
	//	//18

	//	"Ç¿Ç·",   "Ç¿Ç„",	 "Ç¿ÇÂ",
	//	"Ç…Ç·",   "Ç…Ç„",	 "Ç…ÇÂ",
	//	"Ç–Ç·",   "Ç–Ç„",	 "Ç–ÇÂ",
	//	"Ç—Ç·",   "Ç—Ç„",	 "Ç—ÇÂ",
	//	"Ç“Ç·",   "Ç“Ç„",	 "Ç“ÇÂ",
	//	"Ç”Çü",   "Ç”Ç°",	 "Ç”Ç•",	"Ç”Çß",
	//	"Ç”Ç·",   "Ç”Ç„",	 "Ç”ÇÂ",
	//	"Ç›Ç·",   "Ç›Ç„",	 "Ç›ÇÂ",
	//	"ÇËÇ·",   "ÇËÇ„",	 "ÇËÇÂ",

	//	"Ç¡"
	//	//29

	//	"Çü",   "Ç°",	 "Ç£",	  "Ç•",	   "Çß",
	//	"Ç·",   "Ç„",	 "ÇÂ",
	//	"ÇÏ",
	//	"Ç§Çü",   "Ç§Ç°",	 "Ç§Ç•",	 "Ç§Çß",
	//	"ÉîÇü",   "ÉîÇ°",	 "Éî",	  "ÉîÇ•",	   "ÉîÇß",
	//	"ÇƒÇ°",   "Ç≈Ç°",	 "Ç≈Ç„",
	//	"Å[",
	//	//32
	//};
	//